export default {
  projections: {
    СотрудникиE: {
      фИО: {
        __caption__: 'ФИО'
      },
      пол: {
        __caption__: 'Пол'
      },
      датаРождения: {
        __caption__: 'Дата рождения'
      },
      серияПаспорта: {
        __caption__: 'Серия паспорта'
      },
      номерПаспорта: {
        __caption__: 'Номер паспорта'
      },
      телефон: {
        __caption__: 'Телефон'
      },
      iDСотрудника: {
        __caption__: 'ID сотрудника'
      },
      должности: {
        __caption__: 'Должности',
        наименование: {
          __caption__: 'Должность'
        },
        подразделения: {
          __caption__: '',
          наименование: {
            __caption__: 'Подразделение'
          }
        }
      }
    },
    СотрудникиL: {
      фИО: {
        __caption__: 'ФИО'
      },
      пол: {
        __caption__: 'Пол'
      },
      датаРождения: {
        __caption__: 'Дата рождения'
      },
      серияПаспорта: {
        __caption__: 'Серия паспорта'
      },
      номерПаспорта: {
        __caption__: 'Номер паспорта'
      },
      телефон: {
        __caption__: 'Телефон'
      },
      iDСотрудника: {
        __caption__: 'ID сотрудника'
      },
      должности: {
        __caption__: 'Должность',
        наименование: {
          __caption__: 'Должность'
        }
      }
    }
  },
  validations: {
    iDСотрудника: {
      __caption__: 'ID сотрудника'
    },
    датаРождения: {
      __caption__: 'Дата рождения'
    },
    номерПаспорта: {
      __caption__: 'Номер паспорта'
    },
    пол: {
      __caption__: 'Пол'
    },
    серияПаспорта: {
      __caption__: 'Серия паспорта'
    },
    телефон: {
      __caption__: 'Телефон'
    },
    фИО: {
      __caption__: 'ФИО'
    },
    должности: {
      __caption__: 'Должности'
    }
  }
};
