export default {
  projections: {
    ОрганизацияE: {
      наименование: {
        __caption__: 'Наименование'
      },
      иНН: {
        __caption__: 'ИНН'
      },
      кПП: {
        __caption__: 'КПП'
      },
      оГРН: {
        __caption__: 'ОГРН'
      },
      телефон: {
        __caption__: 'Телефон'
      },
      почта: {
        __caption__: 'Почта'
      },
      юрАдрес: {
        __caption__: 'Юр адрес'
      }
    },
    ОрганизацияL: {
      наименование: {
        __caption__: 'Наименование'
      },
      иНН: {
        __caption__: 'ИНН'
      },
      кПП: {
        __caption__: 'КПП'
      },
      оГРН: {
        __caption__: 'ОГРН'
      },
      телефон: {
        __caption__: 'Телефон'
      },
      почта: {
        __caption__: 'Почта'
      },
      юрАдрес: {
        __caption__: 'Юр адрес'
      }
    }
  },
  validations: {
    иНН: {
      __caption__: 'ИНН'
    },
    кПП: {
      __caption__: 'КПП'
    },
    наименование: {
      __caption__: 'Наименование'
    },
    оГРН: {
      __caption__: 'ОГРН'
    },
    почта: {
      __caption__: 'Почта'
    },
    телефон: {
      __caption__: 'Телефон'
    },
    юрАдрес: {
      __caption__: 'Юр адрес'
    }
  }
};
